{
  "Sahih Bukhari": {
    "1": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'ሥራዎች የሚለኩት በኒያ (በሐሳብ) ነው። ላያንዳንዱም ሰው ያሰበው ነገር አለው። ስደቱ ወደ አላህና ወደ መልእክተኛው የሆነ ሰው ስደቱ ወደ አላህና ወደ መልእክተኛው ነው። ስደቱም ለምድራዊ ጥቅም ወይም ለሚያገባት ሴት የሆነ ሰው ስደቱ ወደ ተሰደደበት ነገር ነው።'",
    "2": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'ከእናንተ አንዳችሁ እኔ ከወላጁ፣ ከልጁና ከሰዎች ሁሉ ይበልጥ ተወዳጅ እስካልሆንኩለት ድረስ አላመነም።'",
    "3": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'ከናንተ አንዳችሁ ለራሱ የሚወደውን ለወንድሙ እስካልወደደ ድረስ አላመነም።'",
    "4": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'እስልምና በአምስት ነገሮች ላይ ተገነባ። ከአላህ ሌላ አምላክ እንደሌለና ሙሐመድም የአላህ መልእክተኛ መሆናቸውን መመስከር፣ ሶላትን ደንቡን ጠብቆ መስገድ፣ ዘካን መስጠት፣ የረመዳንን ወር መጾምና ሐጅ ማድረግ ናቸው።'",
    "5": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'ምቀኝነት መልካም ሥራን ትበላለች፤ እሳት እንጨትን እንደምትበላ ሁሉ።'",
    "6": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'ጠንካራ አማኝ ደካማ ከሆነ አማኝ ይልቅ አላህ ዘንድ የተወደደ እና በላጭ ነው።'",
    "7": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'መመካከር እኮ እምነት ነው።'",
    "8": "የአላህ መልእክተኛ (ሶ.ዐ.ወ) እንዲህ ብለዋል፡- እስልምና በአምስት (በሚከተሉት) ላይ የተመሰረተ ነው። \n(መርሆች)፡- \n\n\n1. ከአላህ በስተቀር ማንም ሊመለክበት መብት እንደሌለው መመስከር እና \nሙሐመድ የአላህ መልእክተኛ (ሶ.ዐ.ወ) ናቸው። \n\n\n2. (ግዴታ የጀመዓን) ሶላቶችን በአግባቡ መስገድ እና \nፍጹም። \n\n\n3. ዘካን ለመክፈል (ማለትም የግዴታ ሰደቃ) . \n\n\n4. ሐጅ ለማድረግ። (ማለትም ወደ መካ የሚደረግ ጉዞ) \n\n\n5. በረመዷን ወር መጾም።",
    "9": "ነቢዩ (ﷺ) እንዲህ ብለዋል፡- “እምነት (እምነት) ከስልሳ በላይ ቅርንጫፎችን ያቀፈ ነው። \n(ማለትም ክፍሎች). እና ሀያ (ይህ ቃል \"ሀያ\" ብዙ ቁጥርን ይሸፍናል \nአንድ ላይ መወሰድ ያለባቸው ጽንሰ-ሐሳቦች; ከነሱ መካከል እራስ ናቸው። \nክብር፣ ጨዋነት፣ አሳፋሪነት፣ እና ብልግና፣ ወዘተ.) የዚያ አካል ነው። \nእምነት\"",
    "10": "ነብዩ (ሶ.ዐ.ወ) እንዲህ ብለዋል፡- “ሙስሊም ማለት ሙስሊሞችን ከመጉዳት የተቆጠበ ነው። \nአንደበቱን እና እጆቹን. ሙሃጅርም (ስደተኛ) ተስፋ የሚሰጥ ነው። \nአላህ የከለከለውን ሁሉ (ይተዋቸዋል)።",
    "11": "አንዳንድ ሰዎች የአላህን መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) “የማን እስልምና በላጭ ነው?” ሲሉ ጠየቁ። \nበጣም ጥሩ ሙስሊም ነው)?\" እሳቸውም እንዲህ ሲሉ መለሱ፡- “ማንም ከመጉዳት የሚቆጠብ \nሙስሊሞች በምላሱ እና በእጆቹ\"",
    "12": "አንድ ሰው ነብዩን (ሶ.ዐ.ወ) እንዲህ ሲል ጠየቃቸው፡- “ምን አይነት ተግባር ወይም (የምን ባህሪ) \nእስልምና ጥሩ ነው?\" ነብዩ (ሶ.ዐ.ወ) እንዲህ ሲሉ መለሱ፡- “ድሆችን ለመመገብ እና ሰላምታ ለመስጠት \nየምታውቃቸውን እና የማታውቃቸውን (ተመልከት \nሀዲስ ቁጥር 27)።",
    "13": "ነብዩ (ሶ.ዐ.ወ) እንዲህ ብለዋል፡- ‹‹ከእናንተ አንዳችሁም ለእርሱ እስካልፈለገ ድረስ እምነት የለውም \n(ሙስሊም) ወንድም ለራሱ የሚወደውን\"",
    "14": "\" የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) እንዲህ አሉ፡- \"ህይወቴ በእጁ በሆነው እምላለሁ አንዳችሁም \nከአባቱና ከአባቱ ይልቅ እኔን እስከወደደኝ ድረስ እምነት ይኖረዋል \nልጆች.\"",
    "15": "ነብዩ (ሶለላሁ ዐለይሂ ወሰለም) እንዲህ ብለዋል \"ከእናንተ አንዳችሁም አብዝቶ እስኪወደኝ ድረስ እምነት አይኖረውም። \nከአባቱ፣ ከልጆቹና ከሰው ልጆች ሁሉ ይልቅ።",
    "16": "ነብዩ (ሶ.ዐ.ወ) እንዲህ ብለዋል፡- “የሚከተሉትን ሶስት ባህሪያት የያዘ ሰው \nየእምነት ጣፋጭ (ደስታ) ይኖረዋል። \n\n\n1. አላህና መልክተኛው ከምንም በላይ የተወደዱለት ሰው \nሌላ. \n\n\n2. ሰውን የወደደ እና ለአላህ ብሎ ብቻ የወደደ። \n\n\n3. መወርወርን እንደሚጠላ ወደ ቲኢዝም (ክህደት) መመለስን የሚጠላ \nወደ እሳቱ ውስጥ.\"",
    "17": "ነብዩ (ሶ.ዐ.ወ) እንዲህ ብለዋል፡- “አንሷሮችን መውደድ የእምነትና የጥላቻ ምልክት ነው። \nአንሷሮች የመናፍቅነት ምልክት ናቸውና።",
    "18": "በበድር ጦርነት ላይ የተሳተፈ እና ናቂብ (አመራር የሆነ ሰው) ነበር። \nየስድስት ሰዎች ስብስብ) በአል-አቃባ ሌሊት ቃል ኪዳን፡ የአላህ \nሐዋሪያው ከባልደረቦቻቸው መካከል የተወሰኑ ሰዎች በዙሪያው እያሉ እንዲህ አለ፡- “ማል \nታማኝነት ለኔ፡- \n\n\n1. ከአላህ ጋር ምንም አይነት አምልኮ አለማድረግ። \n\n\n2. ላለመስረቅ. \n\n\n3. ሕገወጥ የግብረ ሥጋ ግንኙነት አለመፈጸም። \n\n\n4. ልጆቻችሁን ለመግደል አይደለም. \n\n\n5. ንፁህ ሰውን ላለመክሰስ (እንዲህ ያለውን ክስ ለማሰራጨት) \nበሰዎች መካከል). \n\n\n6. በጎ ሥራን (በመታዘዝ ጊዜ) አንታዘዝም። \n\n\nነብዩ (ሶ.ዐ.ወ) አክለውም “ከናንተ ውስጥ የገባውን ቃል የሞላ ሰው ይሆናል። \nከአላህ ዘንድ ምንዳ. ከእነርሱም አንዳቸውንም የሚሠራ ሰው (ከዚህ በስተቀር) \nበአላህ ላይ ማጋራት) እና በዚህ ውስጥ ቅጣቱን ይቀበላል \nዓለም፣ ያ ቅጣት ለዚያ ኃጢአት ማስተሰረያ ይሆናል። እና አንድ ከሆነ \nከነሱ አንዱንም ይመታል አላህም ኃጢኣቱን ይደብቃል በርሱ ላይ ብቻ ነው። \nእሱን ይቅር ለማለት ወይም ለመቅጣት (በመጨረሻው ዓለም)። ኡባዳ ቢን አስ-ሳሚት \nአክለውም \"ስለዚህ ለእነዚህ ታማኝነታችንን ማልን.\" ( ወደ አላህ ይጠቁማል \nሐዋርያ)",
    "19": "የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) እንዲህ ብለዋል፡- “የአንድ ሙስሊም በላጩ በጎች የሚሆነው በጎች ሲሆን በተራራ አናት ላይ እና የዝናብ ቦታዎችን (ሸለቆዎችን) በመያዝ በሃይማኖቱ ከችግር ይሸሻል።",
    "20": "የአላህ መልእክተኛ (ሶ.ዐ.ወ) ሙስሊሞችን አንድ ነገር እንዲያደርጉ ባዘዙ ቁጥር ይጠቀሙ ነበር። \nለነሱ ቀላል የኾነን ሥራ ልታዘዝላቸው \nየእነሱ ጥንካሬ እና ጽናት)። የአላህ መልእክተኛ (ሶ.ዐ.ወ) አይደለንም አሉ። \nእንደ እርስዎ. አላህ ያለፈውንም ሆነ የሚመጣውን ኃጢአቶቻችሁን ይቅር ብሎላችኋል። ስለዚህ የአላህ \nሐዋርያ ተቆጣ እና በፊቱ ላይ ታየ። እኔ ነኝ አለ። \nአላህን የፈራ አላህንም ከሁላችሁም በላይ ዐዋቂ ነው።",
    "21": "ነብዩ (ሶ.ዐ.ወ) እንዲህ ብለዋል፡- “የሚከተሉትን ሶስት ባህሪያት የያዘ ሰው \nየእምነትን ጣፋጭነት ይቀምስማል። \n\n\n1. አላህና መልክተኛው ከምንም በላይ የተወደዱበት ሰው \nሌላ. \n\n\n2. ሰውን የወደደ እና ለአላህ ብሎ ብቻ የወደደ። \n\n\n3. አላህ ካመጣ በኋላ ወደ ክህደት (ተውሒድ) መመለስን የሚጠላ \nበእሳት መወርወርን እንደሚጠላ ከርሷ (ያዳነው)።",
    "22": "ነብዩ (ሶ.ዐ.ወ) እንዲህ ብለዋል፡- “የጀነት ሰዎች ጀነት ሲገቡ እና \nየጀሀነም ሰዎች ወደ ገሀነም ይገባሉ፡ አላህ ያላቸውን ያዛል \nለመወሰድ የሰናፍጭ ቅንጣት የሚያህል እምነት ነበረው። \nከገሃነም መውጣት. ወደ ውጭም ይወጣሉ ግን (በዚያን ጊዜ) ይሆናሉ \nየጠቆረ (የተቃጠለ)። ከዚያም በሀያ ወንዝ ውስጥ ይቀመጣሉ. \n(ዝናብ) ወይም ሀያት (ሕይወት) (ተራኪው የትኛው እንደሆነ ጥርጣሬ ውስጥ ገብቷል። \nትክክለኛ ጊዜ) እና እነሱ በአጠገቡ እንደሚበቅል እህል ያድሳሉ \nየጎርፍ ቻናል ባንክ. ቢጫ እንደሚወጣ አታይም እና \nጠማማ\"",
    "23": "የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) እንዲህ ብለዋል፡- “እኔ ተኝቼ ሳለሁ (በህልም) አየሁ \nሸሚዝ የለበሱ ሰዎች አንዳንዶቹ እስከ ጡት ድረስ ይደርሳሉ \nሌሎች ደግሞ ከዚያ ያነሱ ሲሆኑ ብቻ። ዑመር ቢን አል-ኸጣብ ነበሩ። \nየሚጎትተውን ሸሚዝ ለብሶ ታየ። ሰዎቹም \"እንዴት \nተርጉመውታል? (ትርጉሙ ምንድን ነው) የአላህ መልእክተኛ (ሶ.ዐ.ወ) ሆይ? \nእሳቸውም (ነብዩ (ሶ.ዐ.ወ)) “ሃይማኖቱ ነው” ሲሉ መለሱ።",
    "24": "አንድ ጊዜ የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) በሚገስፅ አንሷሪ (ሰው) በኩል አለፉ \nወንድሙ ስለ ሀያ። በዛ ላይ የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) “ተወው \nሀያ የእምነት አካል እንደመሆኗ መጠን። (ሀዲስ 9 ተመልከት)",
    "25": "የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) እንዲህ ብለዋል፡- “እኔ (በአላህ) እንድዋጋ ታዝዣለሁ። \nሰዎቹ ማንም የመመለክ መብት እንደሌለው እስኪመሰክሩ ድረስ \nነገር ግን አላህ እና ሙሐመድ የአላህ መልእክተኛ (ሶ.ዐ.ወ) መሆናቸውን እና ሶላትንም ስገዱ \nበትክክልም ምጽዋትንም ስጡ። ያንንም ቢሠሩ። \nከዚያም ከኢስላማዊ ህግጋቶች በስተቀር ህይወታቸውን እና ንብረታቸውን ከኔ ይታደጋሉ። \nከዚያም ሒሳቦቻቸው (ሒሳቦቻቸው) በአላህ ይፈጸማሉ።",
    "26": "የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) \"ከስራ የሚበልጠው የትኛው ነው?\" እርሱም፡- “ለ \nበአላህና በመልእክተኛው (ሙሐመድ) እመኑ። ጠያቂው እንግዲህ \n\"ቀጣዩ (በጥሩነት) ምንድን ነው? እሱም \"ለመሳተፍ \nበአላህ መንገድ ጂሃድ (ሃይማኖታዊ ውጊያ)። ጠያቂው እንደገና \n\"ቀጣዩ (በጥሩነት) ምንድን ነው?\" እሳቸውም “ሐጅ ለማድረግ \n(የሐጅ ጉዞ ወደ መካ) 'ሙብሩር፣ (በአላህ ዘንድ ተቀባይነት ያለው እና ያለው \nየአላህን ውዴታ በመፈለግ ብቻ ሳይሆን በማሰብ የተደረገ \nለማሳየት እና ኃጢአትን ሳያደርጉ እና በ \nየነቢዩ ወጎች)\"",
    "27": "የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) ዘካትን በሰዎች መካከል አከፋፈለ \nእኔ እዚያ ተቀምጬ ነበር ነገር ግን የአላህ መልእክተኛ (ሶ.ዐ.ወ) ያሰብኩትን ሰው ትተው ሄዱ \nየዕጣው ምርጥ። \"የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) ሆይ! ለምን ይህን ትተህ ሄድክ? \nሰው? በአላህ እምላለሁ እንደ ታማኝ ሙእሚን እቆጥረዋለሁ። ነብዩ (ሶ.ዐ.ወ) \n\"ወይም ሙስሊም ብቻ\" በማለት አስተያየቱን ሰጥቷል። ለጥቂት ጊዜ ዝም አልኩ፣ ግን \nስለ እሱ በማውቀው ነገር ምክንያት ጥያቄዬን ለመድገም አልቻልኩም። \nከዚያም የአላህን መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) \"ለምን እንዲህ እና እንደዚህ ትተህ ሄድክ? በ \nአላህ ሆይ! እርሱ ታማኝ አማኝ ነው።\" ነብዩ (ሶ.ዐ.ወ) በድጋሚ እንዲህ አሉ፡- “ወይ ብቻ \nሙስሊም\" እና በምን ምክንያት ጥያቄዬን ልደግመው አልቻልኩም \nስለ እሱ አውቄ ነበር። ከዚያም ነብዩ (ሶ.ዐ.ወ) እንዲህ አሉ፡- “ሳድ ሆይ! ለአንድ ሰው እሰጣለሁ። \nሌላው ግን በእርሱ ላይ እንዳይጣል ፈርቼ ለእኔ የተወደደ ነው። \nእሳት ውስጥ ፊት በአላህ ይሁን።"
  },
  "Sahih Muslim": {
    "1": "ጅብሪል (ዐ.ሰ) ወደ ነቢዩ (ሰ.ዐ.ወ) መጥቶ ስለ እስልምና፣ ኢማን እና ኢህሳን ጠየቃቸው። ነቢዩም መልሰውለት እርሱም 'እውነት ተናገርክ' አላቸው።",
    "2": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'ዲን (እምነት) ምክር ነው።' ጠየቅን፡- 'ለማን?' አሉም፡- 'ለአላህ፣ ለመጽሐፉ፣ ለመልእክተኛው፣ ለሙስሊም መሪዎች እና ለጠቅላላው ህዝብ።'",
    "3": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'ንጽሕና የኢማን ግማሽ ነው። አልሐምዱሊላህ ሚዛንን ትሞላለች።'",
    "4": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'ከናንተ አንዳችሁ መጥፎ ነገርን ሲያይ በእጁ ይለወጠው። ካልቻለ በምላሱ፣ ካልቻለ በልቡ ይጥላው። ይህ ደግሞ የኢማን ዝቅተኛው ደረጃ ነው።'",
    "7278": "ይህ ከሆነ ከአላህ መልእክተኛ (ሶ.ዐ.ወ) ባልደረቦች ጋር ከተገናኘን ስለ ተቅድር (መለኮታዊ ድንጋጌ) ምን እንደሚባለው እንጠይቃቸዋለን። በአጋጣሚ አብደላህ ኢብኑ ዑመር ኢብኑል ኸጣብ መስጂድ እየገባ ሳለ አገኘነው። እኔና ባልደረባዬ ከበውን። ከመካከላችን አንዱ በቀኙ ቆመን ሌላው በግራው ቆመን። ጓደኛዬ እንድናገር ፍቃድ ይሰጠኛል ብዬ ጠብቄ ነበር። ስለዚህም፡- አቡ አብዱረህማን! በምድራችን ቁርኣንን የሚያነብ እና እውቀትን የሚከታተሉ ሰዎች ታይተዋል። ከዚያም ስለ ጉዳዮቻቸው ከተናገሩ በኋላ አክለው እንዲህ ብለዋል፡- እነሱ (እንዲህ ያሉ ሰዎች) መለኮታዊ ድንጋጌ የሚባል ነገር የለም ይላሉ እና ክስተቶች አስቀድሞ ያልተወሰኑ ናቸው ይላሉ። እሳቸውም (አብዱላህ ኢብኑ ዑመር) እንዲህ አሉ፡- እንዲህ አይነት ሰዎች ባጋጠመህ ጊዜ እኔ ከእነሱ ጋር ምንም ግንኙነት እንደሌለኝ እና ከእኔ ጋር ምንም ግንኙነት እንደሌላቸው ንገራቸው። እነሱም በእኔ (በእምነት) ምንም ተጠያቂ አይደሉም። አብደላህ ኢብኑ ዑመር በርሱ (በጌታ) ማለላቸው (እንዲህም አለ፡- ከመካከላቸው አንዱም (በመለኮታዊው ድንጋጌ የማያምን) የኡሑድ የጅምላውን (ተራራውን) የሚያክል ወርቅ ቢኖረውና (በአላህ መንገድ ላይ) ቢያሳልፍ አላህ በመለኮታዊ ድንጋጌ እምነቱን እስካላረጋገጠ ድረስ አይቀበለውም ነበር። በመቀጠልም እንዲህ አለ፡- አባቴ ዑመር ኢብኑል ኸጣብ እንዲህ አሉኝ፡- አንድ ቀን ከአላህ መልእክተኛ (ሶ.ዐ.ወ) ጋር ተቀምጠን ሳለን አንድ ሰው ከፊታችን ወጣ ያለ ንፁህ ነጭ ልብስ የለበሰ ጸጉሩ በጣም ጥቁር ነው። በእሱ ላይ ምንም የጉዞ ምልክቶች አልነበሩም. ከመካከላችን ማንንም አላወቀውም ነበር። በመጨረሻም ከመልእክተኛው (ሶ.ዐ.ወ) ጋር ተቀምጦ ተንበርክኮ መዳፎቹን ጭኑ ላይ አድርጎ፡- ሙሐመድ ሆይ ስለ አል-ኢስላም አሳውቀኝ። የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) እንዲህ ብለዋል፡- ‹‹አል-ኢስላም ከአላህ በስተቀር ሌላ አምላክ እንደሌለ መመስከርህንና ሙሐመድም የአላህ መልእክተኛ መሆናቸውን ትመሰክራለህ፣ እናም ሶላትን ትሰግዳለህ፣ ዘካን ሰጥተህ፣ የረመዳንን ፆም ስታደርግ፣ የጉዞህን ወጪ ለመሸከም የምትችል ከሆነ ወደ (ቤቱ) ሐጅ አድርግ። (ጠያቂው)፡- እውነት ተናግረሃል አለ። እሳቸውም (ዑመር ኢብኑል ኸጣብ) እንዲህ አሉ፡- ጥያቄውን ማቅረባቸውና ከዚያም እራሳቸው እውነታውን ማረጋገጡ አስገረመን። (ጠያቂው)፡- ኢማንን ንገረኝ አለ። እሳቸውም (ሰ.ዐ.ወ) እንዲህ ሲሉ መለሱ፡- በአላህ፣ በመላእክቱ፣ በመጻሕፍቱ፣ በሐዋርያቱ፣ በፍርድ ቀን እምነትህን አረጋግጠህ ስለ መልካም እና ክፉ በመለኮታዊ ውሳኔ ላይ እምነትህን አረጋግጥ። (ጠያቂው)፡- እውነት ተናግረሃል አለ። እሳቸውም (ጠያቂው) በድጋሚ፡- ስለ አል-ኢህሳን (የመልካም ሥራዎችን አፈጻጸም ንገረኝ) አለ። እሳቸውም (ነብዩ صلى الله عليه وسلم) እንዲህ ብለዋል፡- አላህን እንደምታየው አድርገህ ተገዛው፤ ባታይህም እርሱ በእርግጥ ያየሃልና። (ጠያቂው) እንደገና፡- ሰዓቲቱን (የፍርዱን ጊዜ) ንገረኝ አለ። እሳቸውም (ነብዩ (ሰ. (ጠያቂው)፡- አንዳንድ ምልክቶችን ንገረኝ አለ። እሳቸውም (ነብዩ صلى الله عليه وسلم) እንዲህ ብለዋል፡- “ባሪያይቱ እመቤቷንና ጌታዋን ትወልዳላችሁ፣ ባዶ እግራቸውን የቀሩ የፍየል መንጋዎች በድንቅ ህንፃዎች ግንባታ ላይ እርስ በርስ ሲፋለሙ ታገኛላችሁ። እሳቸውም (ባለታሪኩ ዑመር ኢብኑል ኸጣብ) እንዲህ አሉ፡- ከዚያም (ጠያቂው) መንገዱን ቀጠለ እኔ ግን ከሳቸው (ነብዩ ሰለላሁ አለይሂ ወሰለም) ጋር ለረጅም ጊዜ ቆየሁ። ከዚያም እንዲህ አለኝ፡- ዑመር፣ ይህ ጠያቂ ማን እንደሆነ ታውቃለህ? እኔም፡- አላህና መልእክተኛው ያውቃሉ። እርሱ (ነቢዩ (ሰ. ወደ አንተ የመጣው የሃይማኖትን ነገር ሊያስተምርህ ነው።",
    "7279": "እኔ እና ሁመይድ ለ. አብዱረህማን ሂሚያሪ ተከራከረ። እናም በካህማስ የተነገረውን ሀዲስ እና የስርጭት ሰንሰለቱንም በተመለከተ ውይይቱን አካሄዱ እና አንዳንድ የቃላት ልዩነት አለ።",
    "7280": "አብደላህ ቢ. ዑመር እና ዑመር (ረዐ) ስለ መለኮታዊ ድንጋጌ ተወያይተናል፣ ስለሱም ስለተነጋገሩበት ነገር ዑመር (ረዲየላሁ ዐንሁ) ከመልእክተኛው (ሶ.ዐ.ወ) የተላለፈውን ሐዲስ ዘግበውታል። በዚያ ውስጥ ትንሽ ልዩነት አለ.",
    "7281": "ይኸው ሐዲስ በተለያየ ሰንሰለት ተጠቅሷል።",
    "7282": "አንድ ቀን የአላህ መልእክተኛ (ሶ.ዐ.ወ) በሕዝብ ፊት ቀረቡና አንድ ሰው ወደርሱ መጣና፡- የአላህ ነብይ ሆይ ኢማን ምንድን ነው? በዚህ ጊዜ እሳቸው (ነብዩ (ሰ. እርሱም፡- የአላህ መልእክተኛ አል-ኢስላም ምንድን ነው? እሳቸውም እንዲህ ሲሉ መለሱ፡- አል-ኢስላም ማለት አላህን ተገዙ በርሱም ምንንም እንዳታጋሩና የግዴታ ሶላትን በመስገድ ምጽዋትን (ዘካ) ሰጥተህ የረመዷንን ፆም እንድትፆም ነው። እርሱም፡- የአላህ መልእክተኛ አል-ኢሕሳን ምንድን ነው? እሳቸውም መለሱ፡- አላህን እንደምታየው አድርገህ ታመልከው እና እሱን ማየት ቢያቅትህ ነው። እርሱም፡- የአላህ መልእክተኛ ሰዓቲቱ (የፍርዱ) መቼ ነው? እሳቸውም እንዲህ ሲሉ መለሱ፡- ስለሱ የተጠየቀው ከጠያቂው የተሻለ መረጃ የለውም ነገር ግን ከአንቀጾቹ የተወሰኑትን እነግርሃለሁ። ባሪያይቱ ጌታዋን በወለደች ጊዜ ይህ ከምልክቶቹ ነው። የተራቆቱና ባዶ እግራቸው የሕዝቡ አለቆች ሲሆኑ ይህ ከምልክቶቹ ነው። የጥቁሮች (ግመሎች) እረኞች በሕንፃዎች ውስጥ ሲደሰቱ፣ ይህ ከምልክቶቹ ነው። (ሰዓቲቱም) ከአምስቱ ከአሏህ በስተቀር ማንም የማያውቀው ናት። ከዚያም (አንቀጹን) አነበበ፡- \"አላህ የሰዓቲቱ ዕውቀት እርሱ ዘንድ ብቻ ነው፤ ዝናብንም የሚያወርድ በማሕፀኖች ውስጥ ያለውን ሁሉ የሚያውቅ ነው። ማንኛይቱም ነፍስ ነገ የምትሠራውን አታውቅም። ነፍስም በየትኛው ምድር ላይ እንደምትሞት አታውቅም። አላህ ዐዋቂ ውስጠ ዐዋቂ ነው።\" \nእሳቸውም (አቡ ሁረይራ) አለ፡- ከዚያም ሰውየው ወደ ኋላ ተመለሰና ሄደ። የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) እንዲህ አሉ፡- ያንን ሰው ወደ እኔ መልሱልኝ። ሊመልሱት ሄዱ ነገር ግን ምንም አላዩም። በዚህ ጊዜ የአላህ መልእክተኛ (ሶ.ዐ.ወ) እንዲህ አሉ፡- ጂብሪል ነው እሱም ሰዎችን ሃይማኖታቸውን ሊያስተምር የመጣ ነው።",
    "7283": "ይህ ሐዲስ የተተረከልን በመሐመድ ለ. አብዱላህ ቢ. ኑሜር፣ በመሐመድ ለ. ብሽር፣ በአብዲ ሀያን አል ተይሚ በኩል በዚህ ዘገባ (ኢዛ ዋላዳት አልአማህ ራብሃ ከሚለው ቃል) በስተቀር ቃላቶቹ (ኢዛ ዋልዳተ አልአማህ ባአላህ) ማለትም ባሪያ-ሴት ልጅ ጌታዋን ስትወልድ ነው።",
    "7284": "(ስለ ሀይማኖታዊ ጉዳዮች) ጠይቁኝ ግን እነሱ (ሶሓቦች) እሱን ለመጠየቅ ፈርተው ነበር። ከዚያም መጣ \nአንድ ሰው በጉልበቱ አጠገብ ተቀምጦ፡- የአላህ መልእክተኛ ሆይ አል-ኢስላም ምንድን ነው? ስለዚህ (ነብዩ ሰለላሁ ዐለይሂ ወሰለም)፡- ከምልክቶቹ። (ሰዓቲቱ) ከአምስቱ ሩቆች ነገሮች አንዷ ናት። ከአላህ በስተቀር ማንም የሚያውቃቸው የለም። ከዚያም (ነቢዩ (ሰ. \n\nእሳቸውም (አቡ ሁረይራ) እንዲህ አሉ፡- ከዚያም ሰውየው ተነሳ (መንገዱንም ቀጠለ)። ከዚያም የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም)፡- ወደ እኔ መልሱት። ተፈልጎ ነበር ግን አላገኙትም። የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) እንዲህ አሉ፡- ጂብሪል ነበር ሳትጠይቅም ሊያስተምርህ ፈለገ።",
    "7285": "በቀን እና በሌሊት አምስት ሶላቶች። (በዚህም ላይ፡- ከእነዚህ ውጭ ሌላ (ሶላት) ልሰግድ ይገባኛልን? (ነቢዩ (ሰ.ዐ.ወ)፡- አይደለም ነገር ግን በፈቃዳችሁና የረመዷንን ፆሞች በፈቃዳችሁ የምትጠብቁትን ሁሉ ጠያቂው፡- እኔ ከዚህ ውጭ ሌላ ነገር ማድረግ አለብኝን? (ነብዩ (ሶ.ዐ.ወ)) ከመልእክተኛው (ሶ.ዐ.ወ) የነገራቸውን ሁሉ ነገር ግን ከመልእክተኛው (ሶ. (ድሀ) ጠያቂው እንዲህ አለ፡- “ከዚህ ውጪ ሌላ ነገር ልከፍል ይገባኛልን?",
    "7286": "በአባቱ እዉነተኛ ከሆነ ይሳካለታል ወይም፡- በአባቱ እዉነተኛ ከሆነ ጀነት ይገባ ነበር።",
    "7287": "ከነብዩ (ሰ.ዐ.ወ) ማንኛውንም ነገር (ያለ እውነተኛ ፍላጎት) እንዳንጠይቅ ተከልክለናል። ስለዚህም ከበረሃ ነዋሪ የሆነ አስተዋይ ሰው መጥቶ እሳቸውን (ነቢዩን ሰለሏሁ ዐለይሂ ወሰለም) ቢጠይቀን ደስ ብሎናል። ከበረሃ ነዋሪዎች አንድ ሰው መጣና (ወደ ነብዩ ሰለላሁ አለይሂ ወሰለም) መጣና፡- ሙሐመድ ሆይ መልእክተኛህ ወደ እኛ መጥቶ በእርግጥ አላህ አንተን (ነብይ አድርጎ) ልኮልሃል የሚለውን ቃልህን ነግሮናል። እሳቸውም (ነብዩ ሰለላሁ አለይሂ ወሰለም) እንዲህ አሉ፡- እውነት ተናግሯል። እርሱም (አዳራሹ)፡- ሰማይን የፈጠረው ማን ነው? እሳቸውም (ነብዩ ሰለላሁ ዐለይሂ ወሰለም)፡- አላህ። እርሱም (ድጋሚው) ምድርን የፈጠረው ማን ነው? እሳቸውም (ነብዩ ሰለላሁ ዐለይሂ ወሰለም)፡- አላህ። እርሱም (በድጋሚ)፡- «እነዚህን ተራራዎች ያነሳው ማን ነው በውስጧ የሚፈጠረውንም ማን ፈጠረ? እሳቸውም (ነብዩ ሰለላሁ ዐለይሂ ወሰለም)፡- አላህ። በዚህ ላይ (አዳራሹ)፡- ‹‹በዚያ ሰማያትን በፈጠረ፣ ምድርንም በፈጠረ፣ በርሷም ላይ ጋራዎችን ባደረገው አምላክ እምላለሁን? እሳቸውም (ሰ.ዐ.ወ)፡- አዎ አሉ። እሳቸውም (ባዳዊው) እንዲህ ብለዋል፡- “መልእክተኛህ በቀንና በሌሊት አምስት ሶላቶች (የተሰደዱ) በኛ ላይ ግዴታ መሆናቸውን ነግረውናል። እሳቸውም (ነብዩ صلى الله عليه وسلم) እንዲህ አሉ፡- እውነትን ነግሯችኋል። እሳቸውም (አዳኙ)፡- በአላህ እምላለሁ በዚህ ነገር (ሶላት) ያዛችሁ አላህ ነውን? እሳቸውም (ሰ.ዐ.ወ)፡- አዎ አሉ። (የባዳዊው ሰው) እንዲህ አለ፡- መልእክተኛህ ዘካ በሀብታችን ግዴታ መደረጉን ነግሮናል። እሳቸውም (ነብዩ ሰለላሁ አለይሂ ወሰለም) አሉ። እውነቱን ተናግሯል። እሳቸውም (አዳኙ)፡- በአላህ (በነብይነት) በላከህ እምላለሁ በርሷ (ዘካ) ያዛችሁ አላህ ነውን? እሳቸውም (ሰ.ዐ.ወ)፡- አዎ አሉ። እሳቸውም (ባዳዊው) እንዲህ አሉ፡- መልእክተኛህ በረመዷን ወር በየዓመቱ መፆም ግዴታ መሆኑን ነግረውናል። እሳቸውም (ሰ.ዐ.ወ)፡- እውነት ተናግሯል። (የበረመዷን ሰው)፡- በአላህ (በነብይነት) በላከህ እምላለሁ በእርሱ (የረመዷን ጾም) ያዘዘህ አላህ ነውን? እሳቸውም (ሰ.ዐ.ወ)፡- አዎ አሉ። እሳቸውም (የባዳዊው ሰው) እንዲህ አሉ፡- ‹‹መልእክተኛህ ደግሞ ወደ ቤቱ (የካዕባ) ቤት (ሐጅ) ጉዞ ማድረግ ለቻለ ሰው ግዴታ እንደሆነ ነግረውናል። እሳቸውም (ሰ.ዐ.ወ)፡- አዎ አሉ። ተራኪው እሱ (በዚህ መልስ መደምደሚያ ላይ, ነገር ግን በሚሄድበት ጊዜ) መሄዱን ተናግሯል: - \"በእውነት በላከህ በእርሱ እምላለሁ በነርሱ ላይ ምንም አልጨምርላቸውም ከነሱም ምንም አላጎድልባቸውም። በዚህ ላይ ነቢዩ እንዲህ አሉ፡- እውነት ከሆነ (በተናገረው ነገር) ጀነት መግባት አለበት።",
    "7288": "ከአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) ማንኛውንም ነገር እንዳንጠይቅ በቅዱስ ቁርኣን ተከልክለን ነበር ከዛም አነስ በተመሳሳይ መልኩ ሐዲሱን ዘግቧል።",
    "7289": "ነቢዩ (ሰለላሁ አለይሂ ወሰለም) ለጥቂት ጊዜ ቆም ብለው ወደ ባልደረቦቻቸው ቃኝተው ካዩ በኋላ፡- መልካም እድል ተሰጠው (ወይንም በጥሩ ሁኔታ ተመርቷል) አሉ። እሳቸውም (ሰለላሁ አለይሂ ወሰለም) ለደዊን ሰው ንግግር ሲያደርጉ፡- (የተናገርከውን ድገም) አሉ። እሱ (ቤዱዊን) ደጋግሞ ተናገረ። በዚህ ላይ መልእክተኛው (ሶ.ዐ.ወ) እንዲህ ብለዋል፡- ወደ ጀነት የሚያቀራርብህና ከጀሀነም የሚያስወጣህ ሥራ አላህን መገዛት በርሱም ምንንም እንዳታጋራ፣ ሶላትንም መስገድ፣ ዘካንም መስጠት፣ ለዘመዶችህም በጎ ሥራን መሥራት ነው። ነብዩ (ሶ.ዐ.ወ) እነዚህን ቃላት ከተናገሩ በኋላ የባዳዊውን የግመሉን አፍንጫ እንዲለቅ ጠየቁት።",
    "7290": "ይህ ሐዲስ በሙሐመድ ቢ. ኸቲም በአቡ አዩብ አንሷሪ ሥልጣን።",
    "7291": "ወደ ጀነት ወደሚያቃርበኝ ከእሳትም (ከጀሀነም) ወደሚያወስድኝ ሥራ ምራኝ። በዚህ ላይ (ነብዩ (ሰ. ፊቱን ሲያዞር የአላህ መልእክተኛ (ሶ.ዐ.ወ) እንዲህ ብለዋል፡- የታዘዘውን ቢጠብቅ ጀነት ይገባ ነበር።",
    "7292": "የአላህ መልእክተኛ ሆይ ጀነት መግባት የምችልበትን ስራ ምራኝ። በዚህ ላይ (ነብዩ ሰለላሁ አለይሂ ወሰለም) እንዲህ አሉ፡- አላህን ተገዙ በርሱም ምንንም አታጋሩ፣ ሶላትንም ደንቡን ደንቡን ደንቡን ደንቡን ደንቡን ደንቡን ደንቡን ደንቡን ጠብቀው ስገዱ፡ በናንተ ላይ ያለዎትን ዘካን ስጡ የረመዷንንም ፆም ስገዱ። (እርሱም)፡- ህይወቴ በእጁ በሆነው በእርሱ እምላለሁ በእርሷ ላይ ምንንም አልጨምርባትም ከእርሷም ምንምን አላጎድልም። ጀርባውን በዞረ ጊዜ ነብዩ (ሶ.ዐ.ወ) እንዲህ አሉ፡- ከጀነት ሰዎች አንድን ሰው አይቶ የሚደሰት ሰው በጨረፍታ ያየው።",
    "7293": "የግዴታ ሰላት ብሰግድ እና የተከለከለውን እራሴን ብክድ እና የተፈቀደውን (በሸሪዓው) ሀላል ካደረግኩ ጀነት እገባለሁን? ነቢዩ (ሰለላሁ አለይሂ ወሰለም) በአዎንታዊ መልኩ መለሱ።",
    "7294": "ከዚህ በላይ ምንም አላደርግም።",
    "7295": "የግዴታ ሰላት ብሰግድ፣ የረመዷንን (ፆምን) ብሰግድ፣ የተፈቀደውን (በሸሪዓው) የተፈቀደውን ብይሆን፣ እርም የሆነውን ነገር እራሴን ካድኩ፣ ከሱም ጋር ካልጨመርኩኝ ጀነት ልገባን? እሳቸውም ( ነብዩ صلى الله عليه وسلم) በአዎንታዊ መልኩ መለሱ። (ጠያቂው)፡- በአላህ እምላለሁ ምንም አልጨምርበትም።",
    "7296": "(የላይኛው መዋቅር) አል-ኢስላም በአምስት (ምሶሶዎች) ላይ ተነስቷል፣ i. ሠ. የአላህን አንድነት፣ ሶላትን ማቋቋም፣ ዘካ መስጠት፣ የረመዳን ጾም፣ የሐጅ ጉዞ (ወደ መካ)። \nአንድ ሰው (ለአብዱላህ ኢብኑ ዑመር ረዲየሏሁ ዐንሁም) እንዲህ አለ፡- ከሁለቱ ሀጅ ወይም የረናዳን ፆሞች የሚቀድመው የትኛው ነው? በዚህ ጊዜ እሳቸው (ባለታሪኩ) እንዲህ ሲሉ መለሱ፡- አይደለም (የመጀመሪያው ሐጅ አይደለም) ነገር ግን የረመዷን ጾም ከሐጅ በፊት ይቀድማል።",
    "7297": "(የላይኛው መዋቅር) አል-ኢስላም በአምስት (ምሶሶዎች) ላይ ተነስቷል፣ i. ሠ. አላህ (ብቻውን) መገዛት አለበት።ከርሱም ሌላ አማልክቶችም መካድ አለባቸው። ሶላትን መስገድ፣ ዘካ መስጠት፣ ወደ ቤት መሔድ እና የረመዳን ፆም (በአላህ አንድነት ከማመን እና ሌሎች አማልክትን ከመካድ ውጪ ሌሎች ግዴታዎች ናቸው)።"
  },
  "Jami At-Tirmidhi": {
    "1": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'እውነት ወደ በጎነት ይመራል፣ በጎነት ደግሞ ወደ ጀነት ይመራል። ውሸት ወደ ኃጢአት ይመራል፣ ኃጢአት ደግሞ ወደ እሳት ይመራል።'"
  },
  "Sunan Abu Dawood": {
    "1": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'ከመካከላችሁ አንዱ ምግቡን ሲበላ የአላህን ስም ይጥራ (ቢስሚላህ ይበል)። መጀመሪያ ላይ ከረሳ፣ በ መጨረሻው ‹ቢስሚላሂ አወለሁ ወአኺረሁ› ይበል።'",
    "20505": "ነብዩ (ሰለላሁ አለይሂ ወሰለም) እራሳቸውን ለማስታገስ (ወደ ውጭ) ሲሄዱ ሩቅ ቦታ ሄዱ።",
    "20506": "ነብዩ (ሰለላሁ አለይሂ ወሰለም) እራሳቸውን ማዳን እንደሚያስፈልግ ሲሰማቸው ማንም ሊያያቸው ወደማይችልበት ሩቅ ቦታ ሄዱ።",
    "20507": "አብደላህ ኢብኑ አባስ ወደ ባስራ በመጣ ጊዜ ሰዎች ከአቡ ሙሳ (ረዐ) ተረኩለት። ስለዚህም ኢብኑ አባስ ስለ አንዳንድ ነገሮች ጠየቀው። አቡ ሙሳ ለሱ መልስ ሲሰጡ፡- አንድ ቀን ከአላህ መልእክተኛ (ሶ.ዐ.ወ) ጋር ነበርኩ። መሽናት ፈለገ። ከዚያም ከግድግዳ ግርጌ ለስላሳ መሬት መጥቶ ሽንቱን ሸፈነ። ከዚያም (ነብዩ (ሶ.ዐ.ወ) እንዲህ አሉ፡- ከእናንተ ማንም መሽናት የሚፈልግ ከሆነ ለሽንቱ የሚሆን ቦታ (እንዲህ አይነት) ፈልግ።",
    "20508": "የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) ሽንት ቤት ሲገቡ (ከመግባታቸው በፊት) \"አላህ ሆይ በአንተ እጠበቃለሁ\" ይሉ ነበር። ይህ እንደ ሃማድ ስሪት ነው። አብዱልዋሪዝ ሌላ ስሪት አለው፡- \"ከወንድና ከሴት ሰይጣናት በአላህ እጠበቃለሁ።\"",
    "20509": "\"አላህ ሆይ ባንተ እጠበቃለሁ።\" \n\n\nሹባህ እንዲህ አለ፡- አነስ አንዳንድ ጊዜ \"በአላህ ተጠጋለሁ\" የሚለውን ቃል ዘግቧል።",
    "20510": "የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) እንዲህ ብለዋል፡- እነዚህ ምስጢሮች በጂንና በሰይጣናት የሚዘወተሩ ናቸው። ከእናንተም ውስጥ ማንም ሰው ወደዚያ በሄደ ጊዜ፡- «እኔ ከሰይጣናት ወንድና ሴት በአላህ እጠበቃለሁ።",
    "20511": "ለሰልማን፡- ነቢያችሁ ሁሉንም ነገር ያስተምራችኋል ስለ እዳሪም ጭምር። እርሱም፡- አዎን። በማቅለልና በምንሸናበት ጊዜ ቂብላን እንዳንጋፈጥ ከልክሎናል፤ በቀኝ እጃችን በማንጻት እና ከሶስት በማይበልጡ ጠጠሮች ወይም እበት ወይም አጥንት የምንጠራበት ጊዜ ነው።",
    "20512": "የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) እንዲህ ብለዋል፡- እኔ ለናንተ እንደ አባት ነኝ። ከናንተ አንዳችሁ ወደ ሚስጥራዊነት ሲሄድ ወደ ቂብላ አይጋፈጥ ወይም ጀርባውን አያዞር። በቀኝ እጁ ማጽዳት የለበትም. እሳቸውም (ነብዩ ሰለላሁ ዐለይሂ ወሰለም) ሙስሊሞችን ሶስት ጠጠር እንዲጠቀሙ አዘዙ እበት ወይም የበሰበሰ አጥንት እንዳይጠቀሙ ከልክለዋል።",
    "20513": "እሳቸውም (ነቢዩ ሰለላሁ ዐለይሂ ወሰለም) እንዲህ ብለዋል፡- ‹‹ወደ ምድረ በዳ በምትሄድበት ጊዜ ፊትህንም ሆነ ጀርባህን ወደ ቂብላ አታዙር፤ ነገር ግን ወደ ምሥራቅ ወይም ወደ ምዕራብ ዞር።",
    "20514": "የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) ሽንት በምንወጣበት ጊዜ ሁለቱን ቂብላዎች እንዳንጋፈጥ ከልክለውናል።",
    "20515": "ኢብኑ ዑመር ግመላቸውን ወደ ቂብላ ፊት ለፊት ተንበርክከው፣ ከዚያም አቅጣጫውን እየሸና ሲቀመጥ አየሁ። እኔም አልኩት፡- አቡ አብዱረህማን ይህ አልተከለከለም? እርሱም መልሶ: ለምን አይደለም, ይህ ክፍት አገር ውስጥ ብቻ የተከለከለ ነበር; በናንተና በቂብላ መካከልም የሚደብቅህ ነገር ባለ ጊዜ ምንም ጉዳት የለም።",
    "20516": "የቤቱን ሰገነት ላይ ወጣሁና የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) ከኢየሩሳሌም (በይት አል-መቅዲስ) ፊት ለፊት በሁለት ጡቦች ላይ ተቀምጠው እራሳቸውን ለመገላገል አየሁ።",
    "20517": "የአላህ ነብይ (ሰለላሁ አለይሂ ወሰለም) ውሃ በምንሰራበት ጊዜ ወደ ቂብላ እንዳንጋፈጥ ከልክለውናል። ከዛ ፊት ለፊት (ቂብላ) ሲሸና ወይም እራሱን ሲያመቻች አየሁት ከመሞቱ አንድ አመት በፊት።",
    "20518": "ነብዩ (ሰለላሁ አለይሂ ወሰለም) እፎይታ ለማግኘት ሲፈልጉ ልብሳቸውን አያነሱም ነበር ወደ መሬት አጠገብ እስኪወርዱ ድረስ። \n\n\nአቡ ዳውድ እንዲህ ብለዋል፡- ይህ ወግ በአብዱልሰላም ቢ. ሃርብ በአል-አማሽ ከአነስ ለ. ማሊክ ይህ የባለ ታሪኮቹ ሰንሰለት ደካማ ነው (ምክንያቱም አማሽ ከአናስ ቢ ማሊክ የመስማት ባህሉ አልተረጋገጠም)።",
    "20519": "የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) እንዲህ ሲሉ ሰምቻለሁ፡- ሁለት ሰዎች የግል ብልታቸውን በመግለጥ እና በጋራ ለመነጋገር ሲገናኙ ታላቁና ግርማዊው አላህ በዚህ (ድርጊት) ተቆጥቷል። \n\n\n\nአቡ ዳውድ እንዲህ ብለዋል፡- ይህ ወግ የተተረከው በኢክሪማህ ቢ. 'አማራ።",
    "20520": "አንድ ሰው ነቢዩ (ሰለላሁ አለይሂ ወሰለም) ሽንታቸውን ሲሸኑ አልፈው ሰላምታ ሰጡት። ነቢዩ (ሰለላሁ አለይሂ ወሰለም) ሰላምታውን አልመለሱላቸውም። \n\n\nአቡ ዳውድ እንዲህ ብለዋል፡- ኢብኑ ዑመር (ረዲየላሁ ዐንሁማ) እንደተረከው ነቢዩ (ሶለላሁ ​​ዐለይሂ ወሰለም) ተእሙም ካደረጉ በኋላ ሰላምታውን ወደ ሰውየው መለሱ።",
    "20521": "ሙሃጅር ነብዩ (ሶ.ዐ.ወ) ዘንድ ሽንታቸውን እየሸኑ መጡ። ሰላምታ ሰጠው። ነብዩ (ሶ.ዐ.ወ) ውዱእ እስካደረጉ ድረስ ሰላምታውን አልመለሱላቸውም። ከዚያም ይቅርታ ጠየቀው፡- እኔ አላህን ማውሳትን ከመጥራት በስተቀር አልወድም ነበር።",
    "20522": "የአላህ መልእክተኛ (ሰለላሁ አለይሂ ወሰለም) ታላቁን እና ታላቅ የሆነውን አላህን በማንኛውም ጊዜ ያስታውሷቸው ነበር።",
    "20523": "ነብዩ (ሶ.ዐ.ወ) ወደ ገመና ሲገቡ ቀለበታቸውን አወጡ። \n\n\n\nአቡ ዳውድ እንዲህ ብለዋል፡- ይህ የመንከር ወግ ነው፣ ማለትም ታማኝ ተራኪዎች የዘገቡትን ታዋቂውን ቅጂ ይቃረናል። በአናስ (ረዲየላሁ ዐንሁ) ዘንድ ታዋቂው እትም እንዲህ ይላል፡- ነብዩ (ሶ.ዐ.ወ) የብር ቀለበት ያደርጉላቸው ነበር። ከዚያም ጣለው። አለመግባባቱ በሃማም በኩል ነው (በጽሑፉ ላይ የተጠቀሰው የቀደመ ወግ ገላጭ ነው)። ይህ በሃማም ብቻ ነው የሚተላለፈው.",
    "20524": "ነብዩ (ሶለላሁ ​​ዐለይሂ ወሰለም) በሁለት መቃብር አለፉ። «ሁለቱም (ሙታን) እየተቀጡ ናቸው። ግን በትልቅ (ኃጢአት) አይቀጡም። አንድ ሰው ራሱን ከሽንት አላዳነም። ሌላው ተሸክሟል \nተረቶች ከዚያም አዲስ ቀንበጦችን ጠራና ለሁለት ከፍሎ በእያንዳንዱ መቃብር ላይ አንድ ክፍል ተከለ እና፡- ቀንበጦቹ ትኩስ ሆነው እስከቀሩ ድረስ ቅጣታቸው ይቀንስ ይሆናል። \n\n\nሌላው የሀናድ እትም “አንደኛው ሲሸና ራሱን አልሸፈነም። ይህ ስሪት \"ራሱን ከሽንት አልጠበቀም\" የሚሉት ቃላት የሉትም."
  },
  "Sunan an-Nasa'i": {
    "1": "የአላህ መልእክተኛ (ሰ.ዐ.ወ) እንዲህ ብለዋል፡- 'ሱጁድ ላይ ሆኖ ባሪያ ወደ ጌታው በጣም ይቀርባል። ስለዚህ ዱዓን አብዙ።'"
  }
}